var app = {};
app.translations = {
  ru: {
    english_lang: "English",
    russian_lang: "Русский",
    tajik_lang: "Тоҷикӣ",
    home: "Главная страница",
    about: "О Волшебном Сундучке",
    parents: "Родители",
    educators: "Педагоги",
    faq: "Вопросы и ответы",
    research : "Исследования и отчеты",
    regulatory : "Нормативная база",
    dropdownMenuButton : "Документы",
    magic_box: "Волшебный Сундучок",
    currated_collection: "образовательная цифровая платформа включает в себе коллекцию качественных образовательных материалов для воспитателей и родителей детей до 6 лет.",
    get_started: "Войти",
    im_an_educator: '<i class="fas fa-graduation-cap" style="margin-right: 10px;"></i>Я Педагог',
    im_a_parent: 'Я родитель<i class="fas fa-user-friends" style="margin-left: 10px;"></i>',
    activities_and_games_front: "занятия и игры",
    activities_and_games_back_title: "Занятия и игры",
    activities_and_games_back_desk: "Стимулирующие занятия для родителей и учителей, направленные на поддержку раннего языка и математики, искусства и творчество и социально-эмоциональное обучение детей от рождения до 6 лет.",
    click_here: "Войти",
    courses_for_educators: "курсов для воспитателей",
    lesson_plans: "планов занятий",
    //tips_guides: "советы и руководства",
    cat_сurricula: "учебные программы",
    cat_statistics: "статистика",
    cat_methodical_instructions: "методические пособия",
    cat_professional_dev_courses: "повышение квалификации",
    cat_curriculum: "учебный план",
    cat_articles: "статьи",
    cat_docs: "документы",
    learning_at_home: "Обучение на дому",
    learning_at_home_desc: "Обучение может происходить везде, и не только в детских образовательных учреждениях. Родители и опекуны могут поддерживать обучение и развитие своих детей с помощью занятий, не требующих изысканных или дорогих материалов. Такие занятия, как общение, пение, чтение книг и ответы на вопросы, развивают важные языковые навыки и навыки грамотности в раннем возрасте. Открывая для себя закономерности, геометрические формы и числа в повседневной среде, дети закладывают основу для дальнейшего изучения математики. Процесс игры с маленькими детьми помогает им приобретать навыки решать проблемы, выражать эмоции и налаживать связи со взрослыми.",
    read_more_about_lah: "Узнайте больше об обучении на дому",
    resources_for_preschool: "Ресурсы для воспитателей дошкольных образовательных учреждений",
    resources_for_preschool_desc: "Дети дошкольного возраста находятся в процессе обучения каждый день, от работы над формированием и управлением своими эмоциями до изучения букв, звуков и цифр. Если вы воспитатель дошкольного образования, вы найдете здесь высококачественные ресурсы, которые помогут вам в работе с детьми дошкольного возраста. Планы уроков, занятия и игры, советы и рекомендации, а также курсы повышения квалификации организованы по областям обучения, включая социально-эмоциональное обучение, игры и творчество, раннюю математику и решение проблем, а также язык, грамотность и общение.",
    read_more_about_res: "Узнайте больше о ресурсах для воспитателей",
    looking_for_ways: "Ищете способы заинтересовать вашего ребенка?",
    first_section_lfw: "Язык, грамотность и общение",
    first_section_lfw_desc: "Развитие языковых навыков и навыков грамотности начинается с рождения во время общения со взрослыми, чтения книг и пения. По мере взросления дети развивают язык, разговаривая и слушая когда взрослые читают вслух, как образец для подражания.",
    first_section_ps_em: "Решение задач и ранняя математика",
    first_section_ps_em_desc: "Через повседневные взаимодействия, дети в раннем возрасте развивают понимание математических норм, таких как больше и меньше, сложение и вычитание, размер и местоположение. В этом разделе вы найдете творческие советы и увлекательные игры, в которые вы можете играть со своим ребенком, чтобы развить первые математические навыки.",
    second_section_pc: "Игра и творчество",
    second_section_pc_desc: "Ресурсы в этом разделе поддерживают развитие творческих способностей, воображения и физических навыков, таких как равновесие и мелкая моторика. Родители и преподаватели найдут здесь советы, игры и рекомендации о том, как игра поддерживает важные когнитивные навыки, такие как решение проблем и выражение эмоций.",
    second_section_sel: "Социальное эмоциональное обучение",
    second_section_sel_desc: "Ресурсы в этой категории помогают детям развивать позитивные отношения со взрослыми и другими детьми, а также помогают управлять эмоциями и выражать их. Поочередность, умение делиться, доброта и сочувствие - важные навыки, которые дети усваивают в раннем возрасте.",
    partners: "Партнеры",
    lpu_footer: "Образовательная цифровая платформа «Волшебный Сундучок» была разработана при поддержке ЮНИСЕФ в сотрудничестве с Министерством образования и науки Республики Таджикистан для обеспечения непрерывного доступа к дошкольному образованию.",
    bn_about: "О ПЛАТФОРМЕ",
    bn_about_txt: "Волшебный Сундучок - это новое решение, призванное сократить разрыв в образовании связанный с бедностью. Это техническая платформа, обеспечивающая высококачественное и гибкое обучение.",
    bn_educators: "ПЕДАГОГИ",
    bn_educators_txt: "Независимо от того, работаете ли вы с младенцами и детьми ясельного возраста в детском саду или с детьми дошкольного возраста в дошкольном учреждении, ресурсы в этом разделе предназначены для вас.",
    bn_parents: "РОДИТЕЛИ",
    bn_parents_txt: "Родители могут получить информацию о том, как поддержать рост и развитие маленьких детей в возрасте от рождения до шести лет, с помощью игр, заданий, советов и рекомендаций по различным темам, в том числе о том, как поддерживать детей с ограниченными возможностями и из числа национальных меньшинств в процессе обучения.",

    /*страница about lp*/
    a_about_lp: "О Волшебном Сундучке",
    a_about_lp_desc: "Волшебный Сундучок - это новое решение, призванное сократить разрыв в образовании связанный с бедностью. Это цифровая платформа, обеспечивающая высококачественное и гибкое обучение. Платформа Волшебный Сундучок разработана в сотрудничестве между ЮНИСЕФ, Microsoft и Кембриджским университетом для решения проблем с доступом к непрерывному качественному образованию, с которыми сталкиваются более 1,5 миллиона детей в возрасте от 3 до 6 лет в Таджикистане из-за ограниченных услуг дошкольного образования, что в результате приводит к низкому охвату по всей стране.",
    a_our_mission: "Наша миссия",
    a_our_mission_desc: "Обеспечить детям непрерывный доступ к дошкольному образованию в Таджикистане и способствовать улучшению результатов обучения за счет высококачественного смешанного обучения, чтобы поддержать их подготовку и дальнейшее обучение в школе.",
    a_million_2: "84%",
    a_million_2_desc: "детей в возрасте от 3 до 6 лет (890 000 детей) в Таджикистане не посещают услуги базового дошкольного образования в Таджикистане.",
    a_covid_19: "Реагирование на Covid-19",
    a_covid_19_desc: "Когда в связи с пандемией дошкольные учреждения в Таджикистане были закрыты, платформа «Волшебный Сундучок» была представлена как одно из решений, обеспечивающее непрерывный доступ к обучению для детей и воспитателей. Платформа «Волшебный Сундучок» предоставляет возможности для обучения воспитателей и родителей для обеспечения смешанного обучения в классе и на дому.",
    a_covid_19_desc_2: "Косово, Восточный Тимор и Украина - первыми внедрили свои онлайн-платформы дошкольного образования с помощью цифровых образовательных платформ. Контент, доступный для детей дошкольного возраста, включает онлайн-книги, анимационные программы и дополнительную поддержку для родителей детей с особыми потребностями в обучении.",
    a_lp_world: "Охват цифровой платформы",

    /*страница родителей*/
    par_title: "Родители",
    par_desc: "Родители могут получить информацию о том, как поддержать рост и развитие маленьких детей в возрасте от рождения до шести лет, с помощью игр, заданий, советов и рекомендаций по различным темам, в том числе о том, как поддерживать детей с ограниченными возможностями и из числа национальных меньшинств в процессе обучения.",
    par_how: "Как родители могут извлечь пользу от цифровой платформы Волшебный Сундучок? ",
    par_how_desc: "Обучение может происходить везде, и не только в детских образовательных учреждениях. Родители и опекуны могут поддерживать обучение и развитие своих детей с помощью занятий, не требующих изысканных или дорогих материалов. Такие занятия, как общение, пение, чтение книг и ответы на вопросы, развивают важные языковые навыки и навыки грамотности в раннем возрасте. Открывая для себя закономерности, геометрические формы и числа в повседневной среде, дети закладывают основу для дальнейшего изучения математики. Процесс игры с маленькими детьми помогает им приобретать навыки решать проблемы, выражать эмоции и налаживать связи со взрослыми. Поддерживать и развивать эти навыки дома станет легко с помощью ресурсов цифровой платформы Волшебный Сундучок.",
    par_activites_and_games: "Занятия и игры",
    par_activites_and_games_desc: "Ресурсы для родителей и воспитателей дошкольного образования, которые ищут игры и занятия для своих маленьких детей в возрасте от рождения до шести лет.",
    par_tips_guide: "Советы и рекомендации",
    par_tips_guide_desc: "Полезные советы и рекомендации для родителей и воспитателей детей младшего возраста о том, как поддержать социально-эмоциональное развитие детей, как читать детям вслух и как поддерживать детей с ограниченными возможностями дома и в классе.",
    par_go_actv: "Перейти к занятиям и играм",
    par_go_tips: "Перейти к советам и рекомендациям",
    par_first_tab_line: '<i class="fas fa-home"></i> Играть дома',
    par_second_tab_line: '<i class="fas fa-route"></i> Активный отдых на открытом воздухе',
    par_third_tab_line: '<i class="fas fa-child"></i> Уровни взаимодействия',

    /*FAQ*/
    f_main_title: "Вопросы и ответы",
    f_first_question: '<i class="fas fa-plus faq-plus"></i><i class="fas fa-minus faq-minus"></i>&nbsp;&nbsp;&nbsp; Кто определяет учебные планы стран, переходящих на цифровую платформу?',
    f_first_answer: "Страновая команда ЮНИСЕФ, работающая вместе с Министерством образования и науки и партнерами, обеспечивает включение соответствующей национальной учебной программы в цифровую платформу Волшебный Сундучок. Цифровая платформа Волшебный Сундучок содержит национальный учебный план: структура учебного плана зависит от контекста по своему характеру и фокусируется на сопоставлении местных и глобальных учебных программ, но это отличается от универсальной учебной программы. Программа цифровой платформы Волшебный Сундучок объединяет глобальные образовательные ресурсы, которые можно сопоставить и дополнить в местную учебную программу, чтобы улучшить результаты обучения для пользователей. Это платформа представляет собой локальный и контекстуализированный контент с дополнительными глобальными ресурсами.",
    f_second_question: '<i class="fas fa-plus faq-plus"></i><i class="fas fa-minus faq-minus"></i>&nbsp;&nbsp;&nbsp;Предлагаются ли учебные программы на национальных языках?',
    f_second_answer: "Цель состоит в том, чтобы сделать цифровую платформу Волшебный Сундучок доступной для всех детей. В качестве образовательной модели цифровая платформа Волшебный Сундучок использует контент, разработанный на местном уровне, с дополнительным глобальным контентом, доступным на нескольких языках. Цифровая платформа Волшебный Сундучок развернута на национальном языке и поддерживает национальный язык обучения в стране.",
    f_third_question: '<i class="fas fa-plus faq-plus"></i><i class="fas fa-minus faq-minus"></i>&nbsp;&nbsp;&nbsp;Какими способами можно использовать цифровую платформу Волшебный Сундучок для учащихся и педагогов?',
    f_third_answer_1: "Предлагая простые и легкие способы обучения и достижения целей",
    f_third_answer_2: "Привлекательные интерфейсы, которые делают обучение увлекательным",
    f_third_answer_3: "Развитие навыков с помощью индивидуальных программ обучения",
    f_third_answer_4: "Отслеживание прогресса и оценка результатов с помощью визуальной аналитики",
    f_third_answer_5: "Создание индивидуального режима обучения с использованием предпочтительного устройства и на языке учащегося.",

    /*EDUCATORS*/
    e_main_title: "Педагоги",
    e_edu_desc: "Независимо от того, работаете ли вы с детьми ясельного возраста или с детьми дошкольного возраста в дошкольном учреждении, ресурсы в этом разделе предназначены для вас. Вы найдете высококачественный контент для детей младшего возраста, которым они могут заниматься в самых разных областях, от языка и грамотности до игр и творчества. Вы также найдете курсы повышения квалификации и статьи для поддержки вашего собственного профессионального роста и развития.",
    e_how_title: "Как воспитатели могут извлечь пользу от цифровой платформы Волшебный Сундучок?",
    e_how_desc: "Дети дошкольного возраста находятся в процессе обучения каждый день, от работы над формированием и управлением своими эмоциями до изучения букв, звуков и цифр. Если вы воспитатель дошкольного образования, вы найдете здесь высококачественные ресурсы, которые помогут вам в работе с детьми дошкольного возраста. Планы уроков, занятия и игры, советы и рекомендации, а также курсы повышения квалификации организованы по возрасту и областям обучения, включая социально-эмоциональное обучение, игры и творчество, раннюю математику и решение проблем, а также язык, грамотность и общение.",
    e_courses_title: "Курсы для воспитателей",
    e_courses_desc: "В этом разделе вы найдете курсы повышения квалификации, охватывающие широкий круг тем, в том числе: <ul><li>Многоязыковое обучение детей дошкольного возраста</li><li>Обучение через угру</li><li>Миростроительство с раннего детства</li><li>Инклюзивное образование в детских садах</li><li>Обучение детей с особыми нуждами в образовании и развитии</li>",
    e_courses_desc_1: "создание инклюзивной учебной среды для детей с ограниченными возможностями и из национальных меньшинств,",
    e_courses_desc_2: "понимание развития ребенка и того, как обеспечить рост и развитие детей младшего возраста в полной мере,",
    e_courses_desc_3: "поддержка социально-эмоционального развития маленьких детей и подготовка их к жизни.",
    e_courses_btn: `Перейти к курсам для воспитателей <i class="fas fa-arrow-right"></i>`,
    e_lessons_title: "Планы урока",
    e_lessons_desc: "Ищете ли вы руководство по развитию моторики для малышей или урок счета для 4-летнего ребенка - в этом разделе есть уроки, которые вам нужны. Вы также найдете видео, аудиозаписи, игры и мероприятия, сгруппированные тематике.",
    e_lessons_btn: `Перейти к планам уроков <i class="fas fa-arrow-right"></i>`,
    e_act_title: "Занятия и игры",
    e_act_desc: "Если вы ищете образовательную и веселую игру для вашей группы детей 3-х лет, не надо искать дальше! Здесь вы найдете множество игр для самых разных областей, включая раннюю математику и социально-эмоциональное обучение. Вы также найдете игры и занятия для детей младшего возраста от рождения до 2 лет.",
    e_act_btn: `Перейти к мероприятиям и играм <i class="fas fa-arrow-right"></i>`,
    e_tips_title: "Советы и рекомендации",
    e_tips_desc: "В этом разделе вы найдете полезные советы и рекомендации о том, как поддержать социально-эмоциональное развитие детей, как читать детям вслух и как поддерживать детей с ограниченными возможностями дома и в классе.",
    e_tips_btn: `Перейти к советам и рекомендациям <i class="fas fa-arrow-right"></i>`,
    e_first_tab_line: "Сертификаты",
    e_second_tab_line: "Вспомогательные материалы",
  },
  tj: {
    english_lang: "English",
    russian_lang: "Русский",
    tajik_lang: "Тоҷикӣ",
    home: "Асосӣ",
    research : "Исследования и отчеты",
    regulatory : "Нормативная база",
    dropdownMenuButton : "Санадҳо",
    about: "Дар бораи платформа",
    parents: "Барои волидон",
    educators: "Барои мураббиён",
    faq: "Саволҳо",
    magic_box: "Сандуқчаи Зулбиё",
    currated_collection: "платформаи рақамии таълимӣ барои таҳсилоти томактабӣ ва дорои маводи баландсифат барои мураббиён ва волидони кӯдакони синни то 6 сола.",
    get_started: "Ворид шудан",
    im_an_educator: '<i class="fas fa-graduation-cap" style="margin-right: 10px;"></i>Ман мураббӣ',
    im_a_parent: 'Ман волидон <i class="fas fa-user-friends" style="margin-left: 10px;"></i>',
    activities_and_games_front: "машғулият ва бозиҳо",
    activities_and_games_back_title: "Фаъолият ва бозиҳо",
    activities_and_games_back_desk: "Ҳавасмандгардонии дарсҳо барои волидон ва муаллимон барои дастгирии забони барвақтӣ ва математика, санъат ва эҷодкорӣ ва омӯзиши иҷтимоӣ-эмотсионалӣ барои кӯдакони аз таваллуд то 6-сола.",
    click_here: "Ворид шудан",
    courses_for_educators: "барномаҳои таълимӣ", // маводи омӯзишӣ барои мураббиён
    lesson_plans: "нақшаи таълимӣ",
    //tips_guides: "дастуру тавсияҳо",
    cat_сurricula: "барномаҳои таълимӣ",
    cat_statistics: "омор",
    cat_methodical_instructions: "дастурҳои методӣ",
    cat_professional_dev_courses: "такмили ихтисос", //курсҳои такмили ихтисос
    cat_curriculum: "нақшаи таълимӣ",
    cat_articles: "мақолаҳо",
    cat_docs: "санадҳо",
    learning_at_home: "Таълими хонагӣ",
    learning_at_home_desc: "Омӯзиш на танҳо дар мактаб, балки дар оила низ ташкил карда мешавад. Волидон ва мураббиён метавонанд рушди кӯдакони хурдсолро тавассути машғулиятҳое, ки камхарҷ ва талаботи аз ҳад зиёдро тақозо намекунанд, ба роҳ монанд. Фаъолиятҳои мухталиф, ба монанди суҳбат, хондани китоб, сурудан, савол додан малакаҳои муҳими забондонӣ ва саводи кўдакони синни хурдро инкишоф медиҳанд. Дар шароити ҳаррӯзаи худ мушоҳида кардани нақшҳо, шаклҳо ва рақамҳо барои омӯзиши минбаъдаи тасаввуроти одитарини математикӣ асос мегузорад. Ташкил ва гузаронидани бозӣ бо кӯдакони хурдсол метавонад ба онҳо роҳу усули ҳалли мушкилот, рушди эҳсосот ва эҷоди робитаҳоро бо калонсолони ғамхор таъмин намояд.",
    read_more_about_lah: "Дар бораи таълими хонагӣ маълумоти бештар гиред",
    resources_for_preschool: "Мавод барои мураббиёни муассисаҳои томактабӣ",
    resources_for_preschool_desc: "Дар муассисаҳои томактабӣ кӯдакон аз идора карда тавонистани ҳиссиёти худ то омӯхтани ҳарфу овозҳо ва рақамҳо ба омӯзиш ҳар рӯз машғул мешаванд. Агар шумо мураббии муассисаи томактабӣ бошед, маводи босифатро барои пешбурди кор бо кӯдакони синни томактабӣ пайдо хоҳед кард. Нақшаи машғулиятҳо, фаъолияту бозиҳо, маслиҳатҳо, курсҳои омӯзишӣ ва таълими давомдор дар гурӯҳҳои синнусолӣ ва аз рўйи самтҳои таълим, аз ҷумла омӯзиши иҷтимоӣ-эмотсионалӣ, бозӣ ва эҷодкорӣ, тасаввуроти одитарини математикӣ, ҳалли масъалаҳо, омӯзиши забон, рушди маърифатӣ ва муошират ташкил карда мешаванд.",
    read_more_about_res: "Дар бораи мавод барои омӯзгорон маълумоти бештар гиред",
    looking_for_ways: "Дар ҷустуҷӯйи роҳҳои ҳавасмандкунии фарзандатон ҳастед?",
    first_section_lfw: "Омӯзиши забон, таълими савод ва муошират",
    first_section_lfw_desc: "Инкишофи малакаҳои забономӯзӣ ва рушди нутқи шифоҳии кӯдакон аз таваллуд тавассути муоширати ғамхоронаи калонсолон, китобхонӣ, сурудхонӣ, суҳбат ва ҳикояҳо оғоз меёбад. Бо мурури рушд ва ба воя расидан, кӯдакон малакаҳои забондониро тавассути гуфтугӯй, гӯш кардан ва аз тарафи калонсолон бо овози баланд хондани ҳикояҳо инкишоф медиҳанд.",
    first_section_ps_em: "Ҳалли масъалаҳо ва инкишофи тасаввуроти одитарини математикӣ",
    first_section_ps_em_desc: "Кӯдакони хурдсол фаҳмиши мафҳумҳои математикиро, аз қабили бисёр ва кам, љамъ ва тарҳ, бузургӣ ва мавзеъро тавассути муоширати ҳаррӯза ташаккул медиҳанд. Дар ин бахш, шумо тавсияҳои эҷодӣ ва бозиҳои шавқоварро пайдо мекунед, ки метавонед бо кӯдаки хурдсоли худ бо мақсади рушди малакаҳои аввалияи математикии ӯ истифода баред.",
    second_section_pc: "Бозӣ ва эҷодкорӣ",
    second_section_pc_desc: "Маводи ин бахш рушди эҷодкорӣ, тахайюлот ва малакаҳои ҷисмонӣ, ба монанди тавозун ва малакаҳои хуби системаи таҳрикии ҳаракати (моторика)-ро дастгирӣ мекунанд. Волидон ва мураббиён маслиҳатҳо, бозиҳо ва дастуру тавсияҳоро барои бозӣ, рушди малакаҳои муҳими маърифатӣ, инчунин барои ҳалли мушкилот ва ифодаи эҳсосот дастгирӣ мекунанд, дар ин ҷо пайдо мекунанд.",
    second_section_sel: "Омӯзиши эҳсосотии иҷтимоӣ",
    second_section_sel_desc: "Маводи ин бахш ба кӯдакон дар рушди муносибатҳои мусбӣ бо калонсолон ва дигар кӯдакон, ҳамчунин чӣ гуна идора ва ифодаи эҳсосот кумак мерасонанд. Бо навбат мубодилаи фикр кардан, меҳрубон ва хайрхоҳ будан малакаҳои муҳимест, ки кӯдакон дар синни хурдӣ меомӯзанд.",
    partners: "Шарикон",
    lpu_footer: "Платформаи рақамии таълимии «Сандуқчаи Зулбиё» бо дастгирии ЮНИСЕФ ва ҳамкорӣ бо Вазорати маориф ва илми Ҷумҳурии Тоҷикистон барои таъмини дастрасии доимӣ ба таҳсилоти томактабӣ таҳия шудааст.",
    bn_about: "Дар бораи платформа",
    bn_about_txt: "Ҳамчун як ҳалли наве, ки барои рафъи холигӣ дар соҳаи маориф пешбинӣ шудааст, Сандуқчаи Зулбиё платформаест, ки омӯзиши босифат ва тағйирёбандаро фароҳам меорад.",
    bn_educators: "Мураббиён",
    bn_educators_txt: "Новобаста аз он ки шумо бо кӯдакон дар боғча ё муассисаи таълимии томактабӣ кор мекунед, маводи ин бахш барои шумо ҳаст.",
    bn_parents: "Волидайн",
    bn_parents_txt: "Волидон метавонанд оид ба рушди кӯдакони хурдсоли синни 0 то шашсола, тавассути бозиҳо, машғулиятҳо, дастуру тавсияҳо дар мавзӯъҳои гуногун, аз ҷумла усулҳои дастгирии кӯдакони имконияташон маҳдуд маълумоти бештар гиранд.",

    /*страница about lp*/
    a_about_lp: "Дар бораи Сандуқчаи Зулбиё",
    a_about_lp_desc: "Ҳамчун як воситаи ҳалли вазифаҳоест, ки дар тарбияи насли наврасу пешравии соҳаи маориф пешбинӣ шудааст, Сандуқчаи Зулбиё платформаест, ки омӯзиши босифат ва тағйирёбандаро фароҳам меорад. Сандуқчаи Зулбиё натиҷаи ҳамкориҳои ЮНИСЕФ, Майкрософт ва Донишгоҳи Кембриҷ барои ҳалли мушкилотест, ки беш аз 1,5 миллион кӯдакони синни то 6 сола дар Ҷумҳурии Тоҷикистон ба таҳсилоти доимии босифат ва рафъи маҳдудияти дастрасӣ ва фарогирии кам дар саросари кишвар, таҳия шудааст.",
    a_our_mission: "Вазифаи мо",
    a_our_mission_desc: "Таъмини дастрасии давомдори кӯдакон ва ҷавонон дар ҷумҳурӣ ва баланд бардоштани натиҷаҳои таълим тавассути таҳсилоти баландсифати сайёр барои дастгирии ҷалби онҳо ба дигар зинаи таҳсилот ва ё имкониятҳо, аз ҷумла таҳсилоти расмӣ.",
    a_million_2: "84%",
    a_million_2_desc: "кӯдакони синни аз 3 то 6 сола (890 000  кӯдак) дар ҷумҳурӣ аз имкониятҳо ва хизматрасониҳои таълими барвақтӣ маҳруманд",
    a_covid_19: "Covid-19",
    a_covid_19_desc: "Вақте ки пандемия оғоз ёфт ва муассисаҳои таълимӣ дар Ҷумҳурии Тоҷикистон баста шуданд, платформаи Сандуқчаи Зулбиё ҳамчун яке аз роҳҳои ҳалли таъмини дастрасии доимӣ ба омӯзиш ва таълим барои кӯдакон ва мураббиён пешниҳод карда шуд. Бо платформаи Сандуқчаи Зулбиё ва барномаи таълимӣ, ки имконияти омӯзиши фосилавиро фароҳам меорад, мураббиён ва волидайн метавонанд омӯзиши фосилавиро барои кӯдакони хурдсол бо истифода аз таҷҳизоти зарурӣ дар шароити хона роҳнамоӣ кунанд.",
    a_covid_19_desc_2: "Косово, Тимор-Лесте ва Украина аввалин шуда, барномаи таълимии рушди барвақтии фосилавиро тавассути платформаи рақамӣ ба роҳ монданд, ки он дорои китобҳои рақамӣ, видеофилмҳо ва маводи иловагӣ барои волидони кӯдакони дорои эҳтиёҷоти махсус (маъюбон ва ақаллиятҳо) мебошад.",
    a_lp_world: "Фарогирии платформаи рақамӣ",

    /*страница родителей*/
    par_title: "Волидайн",
    par_desc: "Волидон метавонанд оид ба рушди кӯдакони синни барвақт (аз рӯзи таваллуд то шашсола) тавассути бозиҳо, машғулиятҳо, дастуру тавсияҳо дар мавзуъҳои гуногун, аз ҷумла усулҳои дастгирии кӯдакони имконияташон маҳдуд маълумоти бештар гиранд.",
    par_how: "Волидон аз Сандуқчаи Зулбиё чӣ гуна манфиат гирифта метавонанд?",
    par_how_desc: "Омӯзиш на танҳо дар мактаб, балки дар оила низ ташкил карда мешавад. Волидон ва мураббиён метавонанд рушди кӯдакони хурдсолро тавассути машғулиятҳое, ки камхарҷ ва талаботи аз ҳад зиёдро тақозо намекунанд, ба роҳ монанд. Фаъолиятҳои мухталиф, ба монанди суҳбат, хондани китоб, сурудан, савол додан малакаҳои муҳими забондонӣ ва саводи кӯдакони синни хурдро инкишоф медиҳанд. Дар ҳаёти ҳаррӯза мушоҳида кардани нақшҳо, шаклҳо ва рақамҳо барои омӯзиши баъдии математика замина фароҳам меорад. Бозӣ бо кӯдакони хурдсол дар ҳалли мушкилот, изҳори њиссиёт ва эҷоди робитаҳо бо калонсолони ғамхор кумак мекунад. Инкишоф додани ин малакаҳо дар муҳити хона тавассути захираҳои Сандуқчаи Зулбиё дучанд осон аст.",
    par_activites_and_games: "Машғулиятҳо ва бозиҳо",
    par_activites_and_games_desc: "Мавод барои волидон ва мураббиёни муассисаҳои таҳсилоти томактабӣ, ки дар ҷустуҷӯйи бозиҳо ва машғулиятҳо барои кӯдакони хурди аз рўзи таваллуд то шашсола мебошанд.",
    par_tips_guide: "Дастуру тавсияҳо",
    par_tips_guide_desc: "Дастуру тавсияҳои муфид барои волидон ва мураббиёни муассисаҳои таҳсилоти томактабӣ оид ба рушди иҷтимоиву эҳсосии кӯдакон, тарзи хондани ба кӯдакон ва роҳу усули дастгирии кӯдакони имконияташон маҳдуд дар муҳити хона ва синф.",
    par_go_actv: "Ба машғулиятҳо ва бозиҳо гузаред",
    par_go_tips: "Ба машғулиятҳо ва бозиҳо гузаред",
    par_first_tab_line: '<i class="fas fa-home"></i> Бозӣ дар хона',
    par_second_tab_line: '<i class="fas fa-route"></i> Машғулиятҳо дар берун',
    par_third_tab_line: '<i class="fas fa-child"></i> Сатҳи ҳамкорӣ',

    /*FAQ*/
    f_main_title: "Саволҳои зиёд такроршуда",
    f_first_question: '<i class="fas fa-plus faq-plus"></i><i class="fas fa-minus faq-minus"></i>&nbsp;&nbsp;&nbsp; Кӣ барномаи таълимии кишварҳои мизбони Сандуқчаи Зулбиёро муайян мекунад?',
    f_first_answer: "Гурӯҳи мутахассисони ЮНИСЕФ дар дохили кишвар, ки дар якҷоягӣ бо Вазорати маориф ва илми Ҷумҳурии Тоҷикистон ва шарикон кор карда истодааст, то ба платформаи рақамии Сандуқчаи Зулбиё дохил карда шудани барномаи мувофиқи таълимии миллиро таъмин намояд. Платформаи рақамии Сандуқчаи Зулбиё дорои барномаи миллии таълимӣ мебошад: сохтори барномаи таълимӣ хусусияти миллӣ дорад ва ба таъкид кардани барномаи таълимӣ ва мазмуну хусусиятҳои маҳаллӣ ба таври умумидавлатӣ ва муназзам равона шудааст, аммо ин аз барномаи таълими универсалӣ фарқи калон дорад. Барномаи платформаи рақамии Сандуқчаи Зулбиё китобхонаи маъхазҳои иловагии ҷаҳонии таълимро ҷамъ меорад, ки метавонанд барои беҳтар кардани натиҷаҳои таълим барои корбарон барномаҳои таълимии маҳаллиро ҳамроҳ кунанд ва афзун гардонанд. Ин як платформаи барои тарбияи арзишњои миллӣ ва ба муҳит мувофиқгардонидашуда бо захираҳои иловагии ҷаҳонӣ мебошад.",
    f_second_question: '<i class="fas fa-plus faq-plus"></i><i class="fas fa-minus faq-minus"></i>&nbsp;&nbsp;&nbsp;Оё барномаҳои таълимӣ бо забонҳои миллӣ пешниҳод карда мешаванд?',
    f_second_answer: "Ҳадаф дастрас кардани шиносномаи донишҷӯён барои ҳама кӯдакони осебпазир мебошад. Омӯзиши шиноснома мундариҷаи дар сатҳи маҳаллӣ таҳияшударо ҳамчун модели омӯзишии худ, бо мундариҷаи ҷаҳонии иловагӣ, ки бо забонҳои гуногун мавҷуданд, истифода мебарад. Шиносномаи таҳсил метавонад бо забонҳои гуногуни миллӣ ҷойгир карда шавад ва забони миллии таълимро дар кишвар дастгирӣ кунад.",
    f_third_question: '<i class="fas fa-plus faq-plus"></i><i class="fas fa-minus faq-minus"></i>&nbsp;&nbsp;&nbsp;Бо кадом роҳҳо шумо метавонед платформаи рақамии Сандуқчаи Зулбиёро барои хонандагон ва мураббиён истифода баред?',
    f_third_answer_1: "Пешниҳоди роҳҳои содда ва осон барои омӯзиш ва ноил шудан ба ҳадафҳо",
    f_third_answer_2: "Интерфейсҳои ҷолиб, ки омӯзишро шавқовар мекунанд",
    f_third_answer_3: "Рушди малака тавассути барномаҳои таълими инфиродӣ",
    f_third_answer_4: "Пешрафтро пайгирӣ кунед ва натиҷаҳоро бо таҳлили визуалӣ дар як ҷо чен кунед",
    f_third_answer_5: "Бо истифода аз дастгоҳи рақамӣ ва забони интихобгардидаи хонанда, таҷрибаи омӯзиши инфиродӣ эҷод кунед.",

    /*EDUCATORS*/
    e_main_title: "Мураббиён",
    e_edu_desc: "Новобаста аз он ки шумо бо кӯдакон дар оила ё муассисаи таълимии томактабӣ кор мекунед, маводи ин бахш барои шумо ҳаст. Шумо мундариҷаи баландсифатро барои кӯдакони хурдсол хоҳед ёфт, ки онҳо метавонанд як қатор машғулиятҳо ва самтҳоро, ки аз рушди саводнокӣ ва забономӯзӣ то бозиҳо ва эҷодкорӣ иборат аст, фаро гиранд. Шумо инчунин курсҳои омӯзишӣ ва мақолаҳоро пайдо хоҳед кард, ки барои такмили маҳорати касбии шумо кумак мерасонанд.",
    e_how_title: "Омӯзгорон Сандуқчаи Зулбиёро чӣ гуна истифода мебаранд?",
    e_how_desc: "Кӯдакони синни томактабӣ ҳар рӯз аз идоракунии ҳиссиёти худ то омӯхтани ҳарфҳо, овоз ва рақамҳоро меомӯзанд. Агар шумо мураббии таҳсилоти томактабӣ бошед, дар ин ҷо шумо маводи баландсифатро пайдо мекунед, ки ба шумо дар кор бо кӯдакони синни томактабӣ кумак мерасонанд. Нақшаи дарсҳо, машғулиятҳо ва бозиҳо, дастуру тавсияҳо ва курсҳои таълими давомдор аз рӯи синну сол ҷудо карда шуда, соҳаи таҳсил, аз омӯзиши иҷтимоӣ-эмотсионалӣ, бозӣ ва эҷодкорӣ, математикаи барвақтӣ ва ҳалли масъалаҳо, забономӯзӣ, рушди саводнокӣ ва муошират иборат мебошанд.",
    e_courses_title: "Курсҳои таълимӣ барои мураббиён",
    e_courses_desc: "Дар ин бахш, шумо курсҳои таълими давомдорро хоҳед ёфт, ки як қатор мавзуъҳоро дар бар мегиранд, аз ҷумла:",
    e_courses_desc_1: "Татбиқ ва таълими барномаи бисёрзабонии кӯдакони синни томактабӣ",
    e_courses_desc_2: "Омӯзиш тавассути бозӣ",
    e_courses_desc_3: "Тарбияи сулҳпарварӣ аз давраи синни барвақтии кӯдак",
    e_courses_desc_4: "Таҳсилоти фарогир дар муассисаҳои томактабӣ",
    e_courses_desc_5: "Омӯзиши кӯдакони имконияташон маҳдуд дар таҳсил ва инкишо",
    e_courses_btn: 'Ба курсхоии таълимӣ барои мураббиён гузаред  <i class="fas fa-arrow-right"></i>',
    e_lessons_title: "Нақшаи дарсҳо",
    e_lessons_desc: "Новобаста аз он ки шумо дар ҷустуҷӯйи дастури рушди малакаҳои системаи таҳрикии ҳаракатњо (моторикӣ) барои хурдтаракон ё машғулияти математика барои кӯдакони 4-сола ҳастед, дар ин боб фаъолиятҳои таълимии шумо мавҷуданд. Шумо инчунин видеоҳо, сабтҳои аудиоӣ, бозиҳо ва машқҳоро, ки аз рӯи синну сол ва мавзуъҳо гурӯҳбандӣ шудаанд, дастрас мекунед.",
    e_lessons_btn: `Ба накшаи дарсҳо гузаред <i class="fas fa-arrow-right"></i>`,
    e_act_title: "Машғулият ва бозиҳо",
    e_act_desc: "Агар шумо дар ҷустуҷӯйи бозии таълимӣ ва шавқовар барои кӯдакони 3-сола бошед, дигар ташвиш накашед! Дар ин ҷо шумо бозиҳои зиёдеро барои самтҳои гуногун, аз ҷумла математикаи барвақтӣ, рушди иҷтимоӣ-эҳсосотӣ пайдо мекунед. Шумо инчунин метавонед, бозиҳо ва машғулиятҳоро барои кӯдакони синни барвақт (аз рӯзи таваллуд то 2-сола) дастрас намоед.",
    e_act_btn: `Ба машгулиятхо ва бозихо гузаред <i class="fas fa-arrow-right"></i>`,
    e_tips_title: "Дастуру тавсияҳо",
    e_tips_desc: "Дар ин бахш шумо дастуру тавсияҳои муфидро оид ба рушди иҷтимоӣ ва эҳсосии кӯдакон, тарзи хониш ба кӯдакон ва дастгирии кӯдакони имконияташон маҳдудро дар муҳити хона ва синф пайдо мекунед.",
    e_tips_btn: `Ба дастуру тавсияҳо гузаред <i class="fas fa-arrow-right"></i>`,
    e_first_tab_line: "Шаҳодатномаҳо",
    e_second_tab_line: "Маводи иловагӣ",
  }
};

setLanguage(getCookie('lang') || 'tj');

function setLanguage(language) {
  var x = getCookie('lang');
  if (x) {
    if (x != language) {
      eraseCookie('lang');
      setCookie('lang', language, 7);
    }
  } else {
    setCookie('lang', language, 7);
  }
  document.documentElement.lang = language;
  var currentLanguage = getCookie('lang');

  app.lang = app.translations[currentLanguage] || app.translations.en;
  changeIMG(currentLanguage);
  for (const property in app.lang) {
    // console.log(`${property}: ${app.lang[property]}`);
    if (document.getElementById(property) != null && currentLanguage != "en") {
      document.getElementById(property).innerHTML = app.lang[property];
      document.getElementById(property).style.fontFamily = 'OpenSans';
    }
  }
  
  // custom feedback form settings
  var feedback_frm = document.getElementById('feedback_frm1');
  if(typeof(feedback_frm) != 'undefined' && feedback_frm != null){
    let feedback_page = document.getElementById("feedback_frm2");
    if(currentLanguage=='tj') {
      document.getElementById("feedback_frm1").href="https://forms.gle/ymhPMj8hSD5ADW1X9";
      document.getElementById("feedback_frm1").title="Мушкилоти техникӣ";
      if(typeof(feedback_page) != 'undefined' && feedback_page != null){
        document.getElementById("feedback_frm2").href="https://forms.gle/ymhPMj8hSD5ADW1X9";
        document.getElementById("feedback_frm2").title="Мушкилоти техникӣ";
        document.getElementById("feedback_title1").innerHTML="Агар шумо ҳангоми истифодаи платформа мушкилоти техникӣ дошта бошед - варақаи фикру мулоҳизаҳоро пур кунед";
      }
    }
    if(currentLanguage=='ru') {
      document.getElementById("feedback_frm1").href="https://forms.gle/Ln88WpAXMsSJ5X9Q7";
      document.getElementById("feedback_frm1").title="Форма обратной связи";
      if(typeof(feedback_page) != 'undefined' && feedback_page != null){
        document.getElementById("feedback_frm2").href="https://forms.gle/Ln88WpAXMsSJ5X9Q7";
        document.getElementById("feedback_frm2").title="Форма обратной связи";
        document.getElementById("feedback_title1").innerHTML="Если у Вас возникли технические проблемы при использовании платформы - заполните форму обратной связи";
      }
    }
    if(currentLanguage=='en') {
      document.getElementById("feedback_frm1").href="https://forms.gle/wrL92AP7MvVYWkuG8";
      document.getElementById("feedback_frm1").title="Feedback form";
      if(typeof(feedback_page) != 'undefined' && feedback_page != null){
        document.getElementById("feedback_frm2").href="https://forms.gle/wrL92AP7MvVYWkuG8";
        document.getElementById("feedback_frm2").title="Feedback form";
        document.getElementById("feedback_title1").innerHTML="If you faced technical issues when using the platform - please fill out the feedback form";
      }
    }  
  }

}

function setCookie(name, value, days) {
  var expires = "";
  if (days) {
    var date = new Date();
    date.setTime(date.getTime() + (days * 24 * 60 * 60 * 1000));
    expires = "; expires=" + date.toUTCString();
  }
  document.cookie = name + "=" + (value || "") + expires + "; path=/";
}
function getCookie(name) {
  var nameEQ = name + "=";
  var ca = document.cookie.split(';');
  for (var i = 0; i < ca.length; i++) {
    var c = ca[i];
    while (c.charAt(0) == ' ') c = c.substring(1, c.length);
    if (c.indexOf(nameEQ) == 0) return c.substring(nameEQ.length, c.length);
  }
  return null;
}
function eraseCookie(name) {
  document.cookie = name + '=; Path=/; Expires=Thu, 01 Jan 1970 00:00:01 GMT;';
}

function changeIMG(lang) {
  var img = document.getElementById("moes_logo");
  if(typeof(img) != 'undefined' && img != null)
  {
    if(lang == 'en'){
      img.src = "img/new/maorif_baner_en.png";
    }else if(lang=='ru'){
      img.src = "img/new/maorif_baner_ru.png";
    }else if(lang=='tj'){
      img.src = "img/new/maorif_baner_tj.png";
    }
  }
/*var src = document.getElementById("logo_a");
src.appendChild(img);*/
}

