var app = {};
app.translations = {
  ru: {
    english_lang: "English",
    russian_lang: "Русский",
    tajik_lang: "Тоҷикӣ",
    home: "Главная страница",
    about: "О Волшебном Сундучке",
    parents: "Родители",
    educators: "Педагоги",
    faq: "Вопросы и ответы",
    research : "Исследования и отчеты",
    regulatory : "Нормативная база",
    dropdownMenuButton : "Документы",
    magic_box: "Волшебный Сундучок",
    currated_collection: "образовательная цифровая платформа включает в себе коллекцию качественных образовательных материалов для воспитателей и родителей детей до 6 лет.",
    get_started: "Войти",
    im_an_educator: '<i class="fas fa-graduation-cap" style="margin-right: 10px;"></i>Я Педагог',
    im_a_parent: 'Я родитель<i class="fas fa-user-friends" style="margin-left: 10px;"></i>',
    activities_and_games_front: "наименований занятий и игр",
    activities_and_games_back_title: "Занятия и игры",
    activities_and_games_back_desk: "Стимулирующие занятия для родителей и учителей, направленные на поддержку раннего языка и математики, искусства и творчество и социально-эмоциональное обучение детей от рождения до 6 лет.",
    click_here: "Войти",
    courses_for_educators: "курсов для воспитателей",
    lesson_plans: "планов уроков",
    tips_guides: "советы и руководства",
    learning_at_home: "Обучение на дому",
    learning_at_home_desc: "Обучение происходит везде, а не только в школе. Родители и опекуны могут поддерживать рост и развитие своих детей с помощью занятий, не требующих изысканных или дорогих материалов. Такие занятия, как разговоры, пение, чтение книг и вопросы, развивают важные языковые навыки и навыки грамотности в раннем возрасте. Открывая для себя закономерности, геометрические формы и числа в повседневной среде, дети закладывают основу для дальнейшего изучения математики. Процесс игры с маленькими детьми помогает им приобретать навыки решать проблемы, выражать эмоции и налаживать связи со взрослыми.",
    read_more_about_lah: "Узнайте больше об обучении на дому",
    resources_for_preschool: "Ресурсы для педагогов дошкольных образовательных учреждений",
    resources_for_preschool_desc: "Дети дошкольного возраста находятся в процессе обучения каждый день, от работы над формированием и управлением своими эмоциями до изучения букв, звуков и цифр. Если вы педагог дошкольного образования, вы найдете здесь высококачественные ресурсы, которые помогут вам в работе с детьми дошкольного возраста. Планы уроков, занятия и игры, советы и рекомендации, а также курсы повышения квалификации организованы по возрасту и областям обучения, включая социально-эмоциональное обучение, игры и творчество, раннюю математику и решение проблем, а также язык, грамотность и общение.",
    read_more_about_res: "Узнайте больше о ресурсах для воспитателей",
    looking_for_ways: "Ищете способы заинтересовать вашего ребенка?",
    first_section_lfw: "Язык, грамотность и общение",
    first_section_lfw_desc: "Развитие языковых навыков и навыков грамотности начинается с рождения во время общения со взрослыми, чтения книг, пения, разговоров и рассказов. По мере взросления дети развивают язык, разговаривая и слушая когда взрослые читают вслух, как образец для подражания.",
    first_section_ps_em: "Решение задач и ранняя математика",
    first_section_ps_em_desc: "Дети в раннем возрасте развивают понимание математических норм, таких как больше и меньше, сложение и вычитание, размер и местоположение, через повседневные взаимодействия. В этом разделе вы найдете творческие советы и увлекательные игры, в которые вы можете играть со своим ребенком, чтобы развить первые математические навыки.",
    second_section_pc: "Игра и творчество",
    second_section_pc_desc: "Ресурсы в этом разделе поддерживают развитие творческих способностей, воображения и физических навыков, таких как равновесие и мелкая моторика. Родители и преподаватели найдут здесь советы, игры и рекомендации о том, как игра поддерживает важные когнитивные навыки, такие как решение проблем и выражение эмоций.",
    second_section_sel: "Социальное эмоциональное обучение",
    second_section_sel_desc: "Ресурсы в этой категории помогают детям развивать позитивные отношения со взрослыми и другими детьми, а также помогают управлять эмоциями и выражать их. Поочередность, умение делиться, доброта и сочувствие - важные навыки, которые дети усваивают в раннем возрасте.",
    partners: "Партнеры",
    lpu_footer: "Образовательная цифровая платформа «Волшебный Сундучок» была разработана при поддержке ЮНИСЕФ и сотрудничестве с Министерством образования и науки Республики Таджикистан для обеспечения постоянного доступа к дошкольному образованию.",

    /*страница about lp*/
    a_about_lp: "О Волшебном Сундучке",
    a_about_lp_desc: "Волшебный Сундучок - это новое решение, призванное сократить разрыв в образовании связанный с бедностию. Это техническая платформа, обеспечивающая высококачественное и гибкое обучение. Платформа Волшебный Сундучок разработана в сотрудничестве между ЮНИСЕФ, Microsoft и Кембриджским университетом для решения проблем с доступом к непрерывному качественному образованию, с которыми сталкиваются более 1,5 миллиона детей в возрасте до 6 лет в Таджикистане из-за ограниченных услуг дошкольного образования, что в результате приводит к низкому охвату по всей стране.",
    a_our_mission: "Наша миссия",
    a_our_mission_desc: "Обеспечить детям непрерывный доступ к раннему образованию в Таджикистане и способствовать улучшению результатов обучения за счет высококачественного дистанционного образования, чтобы поддержать их дальнейшее обучение или создать возможности, включая в формальном образовании.",
    a_million: "860 000",
    a_million_desc: "860 000 детей в возрасте от 3 до 6 лет в Таджикистане находятся в группе риска не получить качественное дошкольное образование.",
    a_million_2: "84%",
    a_million_2_desc: "детей в возрасте от 3 до 6 лет в Таджикистане по-прежнему лишены возможности посещать услуги базового дошкольного образования в Таджикистане.",
    a_covid_19: "Реагирование на Covid-19",
    a_covid_19_desc: "Когда в связи с пандемией дошкольные учреждения в Таджикистане были закрыты, платформа Волшебный Сундучок была представлена как одно из решений, обеспечивающее непрерывный доступ к обучению для детей и педагогов. Платформа Волшебный Сундучок и образовательная программа, которой можно обучить педагогов и родителей, смогут облегчить дистанционной обучение детей в домашних условиях.",
    a_covid_19_desc_2: "Косово, Восточный Тимор и Украина - первыми внедрили свои онлайн-программы дошкольного образования с помощью цифровых образовательных платформ. Контент, доступный для детей дошкольного возраста, включает онлайн-книги, видео и дополнительную поддержку для родителей детей с особыми потребностями в обучении (инвалидность и меньшинства).",
    a_lp_world: "Цифровые платформы в мире",

    /*страница родителей*/
    par_title: "Родители",
    par_desc: "Родители могут получить информацию о том, как поддержать рост и развитие маленьких детей в возрасте от рождения до шести лет, с помощью игр, заданий, советов и рекомендаций по различным темам, в том числе о том, как поддерживать детей с ограниченными возможностями и из числа национальных меньшинств в процессе обучения.",
    par_how: "Как родители могут извлечь пользу от цифровой платформы Волшебный Сундучок? ",
    par_how_desc: "Обучение происходит везде, а не только в школе. Родители и опекуны могут поддерживать рост и развитие своих детей с помощью занятий, не требующих изысканных или дорогих материалов. Такие занятия, как разговоры, пение, чтение книг и вопросы, развивают важные языковые навыки и навыки грамотности в раннем возрасте. Открывая для себя закономерности, геометрические формы и числа в повседневной среде, дети закладывают основу для дальнейшего изучения математики. Процесс игры с маленькими детьми помогает им приобретать навыки решать проблемы, выражать эмоции и налаживать связи со взрослыми. Поддерживать и развивать эти навыки дома станет легко с помощью ресурсов цифровой платформы Волшебный Сундучок.",
    par_activites_and_games: "Занятия и игры",
    par_activites_and_games_desc: "Ресурсы для родителей и педагогов дошкольного образования, которые ищут игры и занятия для своих маленьких детей в возрасте от рождения до шести лет.",
    par_tips_guide: "Советы и рекомендации",
    par_tips_guide_desc: "Полезные советы и рекомендации для родителей и воспитателей детей младшего возраста о том, как поддержать социально-эмоциональное развитие детей, как читать детям вслух и как поддерживать детей с ограниченными возможностями дома и в классе.",
    par_go_actv: "Перейти к занятиям и играм",
    par_go_tips: "Перейти к советам и рекомендациям",
    par_first_tab_line: '<i class="fas fa-home"></i> Играть дома',
    par_second_tab_line: '<i class="fas fa-route"></i> Активный отдых на открытом воздухе',
    par_third_tab_line: '<i class="fas fa-child"></i> Уровни взаимодействия',

    /*FAQ*/
    f_main_title: "Вопросы и ответы",
    f_first_question: '<i class="fas fa-plus faq-plus"></i><i class="fas fa-minus faq-minus"></i>&nbsp;&nbsp;&nbsp; Кто определяет учебные планы стран, переходящих на цифровую платформу?',
    f_first_answer: "Страновая команда ЮНИСЕФ, работающая вместе с Министерством образования и науки и партнерами, обеспечивает включение соответствующей национальной учебной программы в цифровую платформу Волшебный Сундучок. Цифровая платформа Волшебный Сундучок содержит национальный учебный план: структура учебного плана зависит от контекста по своему характеру и фокусируется на сопоставлении местных и глобальных учебных программ, но это отличается от универсальной учебной программы. Программа цифровой платформы Волшебный Сундучок объединяет глобальные образовательные ресурсы, которые можно сопоставить и дополнить в местную учебную программу, чтобы улучшить результаты обучения для пользователей. Это платформа представляет собой локальный и контекстуализированный контент с дополнительными глобальными ресурсами.",
    f_second_question: '<i class="fas fa-plus faq-plus"></i><i class="fas fa-minus faq-minus"></i>&nbsp;&nbsp;&nbsp;Предлагаются ли учебные программы на национальных языках?',
    f_second_answer: "Цель состоит в том, чтобы сделать цифровую платформу Волшебный Сундучок доступной для всех детей. В качестве образовательной модели цифровая платформа Волшебный Сундучок использует контент, разработанный на местном уровне, с дополнительным глобальным контентом, доступным на нескольких языках. Цифровая платформа Волшебный Сундучок развернута на национальном языке и поддерживает национальный язык обучения в стране.",
    f_third_question: '<i class="fas fa-plus faq-plus"></i><i class="fas fa-minus faq-minus"></i>&nbsp;&nbsp;&nbsp;Какими способами можно использовать цифровую платформу Волшебный Сундучок для учащихся и педагогов?',
    f_third_answer_1: "Предлагая простые и легкие способы обучения и достижения целей",
    f_third_answer_2: "Привлекательные интерфейсы, которые делают обучение увлекательным",
    f_third_answer_3: "Развитие навыков с помощью индивидуальных программ обучения",
    f_third_answer_4: "Отслеживание прогресса и оценка результатов с помощью визуальной аналитики",
    f_third_answer_5: "Создание индивидуального режима обучения с использованием предпочтительного устройства и на языке учащегося.",

    /*EDUCATORS*/
    e_main_title: "Педагоги",
    e_edu_desc: "Независимо от того, работаете ли вы с младенцами и детьми ясельного возраста в детском саду или с детьми дошкольного возраста в дошкольном учреждении, ресурсы в этом разделе предназначены для вас. Вы найдете высококачественный контент для детей младшего возраста, которым они могут заниматься в самых разных областях, от языка и грамотности до игр и творчества. Вы также найдете курсы повышения квалификации и статьи для поддержки вашего собственного профессионального роста и развития.",
    e_how_title: "Как педагоги могут извлечь пользу от цифровой платформы Волшебный Сундучок? ",
    e_how_desc: "Дети дошкольного возраста находятся в процессе обучения каждый день, от работы над формированием и управлением своими эмоциями до изучения букв, звуков и цифр. Если вы педагог дошкольного образования, вы найдете здесь высококачественные ресурсы, которые помогут вам в работе с детьми дошкольного возраста. Планы уроков, занятия и игры, советы и рекомендации, а также курсы повышения квалификации организованы по возрасту и областям обучения, включая социально-эмоциональное обучение, игры и творчество, раннюю математику и решение проблем, а также язык, грамотность и общение.",
    e_courses_title: "Курсы для педагогов",
    e_courses_desc: "В этом разделе вы найдете курсы повышения квалификации, охватывающие широкий круг тем, в том числе:",
    e_courses_desc_1: "создание инклюзивной учебной среды для детей с ограниченными возможностями и из национальных меньшинств,",
    e_courses_desc_2: "понимание развития ребенка и того, как обеспечить рост и развитие детей младшего возраста в полной мере,",
    e_courses_desc_3: "поддержка социально-эмоционального развития маленьких детей и подготовка их к жизни.",
    e_courses_btn: `Перейти к курсам для воспитателей <i class="fas fa-arrow-right"></i>`,
    e_lessons_title: "Планы урока",
    e_lessons_desc: "Ищете ли вы руководство по развитию моторики для малышей или урок счета для 4-летнего ребенка - в этом разделе есть уроки, которые вам нужны. Вы также найдете видео, аудиозаписи, игры и мероприятия, сгруппированные по возрасту и тематике.",
    e_lessons_btn: `Перейти к планам уроков <i class="fas fa-arrow-right"></i>`,
    e_act_title: "Занятия и игры",
    e_act_desc: "Если вы ищете образовательную и веселую игру для вашей группы деей 3-х лет не надо искать дальше! Здесь вы найдете множество игр для самых разных областей, включая раннюю математику и социально-эмоциональное обучение. Вы также найдете игры и занятия для детей младшего возраста от рождения до 2 лет.",
    e_act_btn: `Перейти к мероприятиям и играм <i class="fas fa-arrow-right"></i>`,
    e_tips_title: "Советы и рекомендации",
    e_tips_desc: "В этом разделе вы найдете полезные советы и рекомендации о том, как поддержать социально-эмоциональное развитие детей, как читать детям вслух и как поддерживать детей с ограниченными возможностями дома и в классе.",
    e_tips_btn: `Перейти к советам и рекомендациям <i class="fas fa-arrow-right"></i>`,
    e_first_tab_line: "Сертификаты",
    e_second_tab_line: "Вспомогательные материалы",
  },
  tj: {
    english_lang: "English",
    russian_lang: "Русский",
    tajik_lang: "Тоҷикӣ",
    home: "Асосӣ",
    research : "Исследования и отчеты",
    regulatory : "Нормативная база",
    dropdownMenuButton : "Санадҳо",
    about: "Дар бораи платформа",
    parents: "Барои волидон",
    educators: "Барои мураббиён",
    faq: "Саволҳо",
    magic_box: "Сандуқчаи Зулбиё",
    currated_collection: "платформаи рақамии таълимӣ барои таҳсилоти томактабӣ ва дорои маводи баландсифат барои мураббиён ва волидони кӯдакони синни то 6 сола.",
    get_started: "Ворид шудан",
    im_an_educator: '<i class="fas fa-graduation-cap" style="margin-right: 10px;"></i>Ман мураббӣ',
    im_a_parent: 'Ман волидон <i class="fas fa-user-friends" style="margin-left: 10px;"></i>',
    activities_and_games_front: "фаъолият ва бозиҳо",
    activities_and_games_back_title: "Фаъолият ва бозиҳо",
    activities_and_games_back_desk: "Ҳавасмандгардонии дарсҳо барои волидон ва муаллимон барои дастгирии забони барвақтӣ ва математика, санъат ва эҷодкорӣ ва омӯзиши иҷтимоӣ-эмотсионалӣ барои кӯдакони аз таваллуд то 6-сола.",
    click_here: "Ворид шудан",
    courses_for_educators: "маводи омӯзишӣ барои мураббиён",
    lesson_plans: "нақшаи дарсҳо",
    tips_guides: "дастуру тавсияҳо",
    learning_at_home: "Таҳсили хонагӣ",
    learning_at_home_desc: "Омӯзиш дар ҳама ҷо рух медиҳад, на танҳо дар мактаб. Волидон ва мураббиён метавонанд рушди кӯдакони хурдсолро тавассути машғулиятҳое, ки камхарҷ ва талаботи аз ҳад зиёдро тақозо намекунанд, ба роҳ монанд. Фаъолиятҳое чун сӯҳбат, хондани китобу суруд, ва савол додан малакаҳои муҳими забондонӣ ва рушди саводро дар синни хурдсолӣ инкишоф медиҳанд. Дар шароити ҳаррӯзаи худ мушоҳида кардани нақшҳо, шаклҳо ва рақамҳо барои омӯзиши минбаъдаи математика асос мегузорад. Бозӣ бо кӯдакони хурдсол ба онҳо роҳу усули  ҳалли мушкилот, изҳори эҳсосот ва эҷоди робитаҳо бо калонсолони ғамхор кӯмак мерасонад.",
    read_more_about_lah: "Дар бораи таълими хонагӣ маълумоти бештар гиред",
    resources_for_preschool: "Мавод барои мураббиёни муассисаҳои томактабӣ",
    resources_for_preschool_desc: "Аз рафти идоракунии эҳсосоти худ то омӯхтани ҳарфҳо, садоҳо ва рақамҳо дар муассисаҳои томактабӣ, кӯдакон ҳар рӯз ба омӯзиш машғуланд. Агар шумо мураббии муассисаи томактабӣ бошед, маводи сифатнокро барои пешбурди кор бо кӯдакони синни томактабиро пайдо хоҳед кард. Нақшаи дарсҳо, фаъолиятҳо ва бозиҳо, маслиҳатҳо, курсҳои омӯзишӣ ва таълими давомдор аз рӯи гурӯҳҳои синну сол ва соҳаи таҳсил, аз ҷумла омӯзиши иҷтимоӣ-эмотсионалӣ, бозӣ ва эҷодкорӣ, математикаи барвақтӣ, ҳалли масъалаҳо, омӯзиши забон, рушди саводнокӣ ва муошират ташкил карда мешаванд.",
    read_more_about_res: "Дар бораи мавод барои омӯзгорон маълумоти бештар гиред",
    looking_for_ways: "Дар ҷустуҷӯи роҳҳои ҳавасманд намудани фарзандатон ҳастед?",
    first_section_lfw: "Омӯзиши забон, таълими савод ва муошират",
    first_section_lfw_desc: "Инкишофи малакаҳои забономӯзӣ ва рушди саводнокӣ аз таваллуд тавассути муоширати ғамхорона бо калонсолон, китобхонӣ, сурудхонӣ, сӯҳбат ва ҳикояҳо оғоз меёбад.  Бо мурури рушд ва ба воя расидан, кӯдакон малакаҳои забондониро тавассути гуфтугӯ, гӯш кардан ва аз тарафи калонсолон бо овози баланд хондани ҳикояҳо инкишоф медиҳанд.",
    first_section_ps_em: "Ҳалли масъалаҳо ва математикаи ибтидоӣ",
    first_section_ps_em_desc: "Кӯдакони хурдсол фаҳмиши мафҳумҳои математикиро, аз қабили бештар ва камтар, илова ва тарҳ, андоза ва мавзеъро тавассути муоширати ҳаррӯза ташаккул медиҳанд. Дар ин бахш, шумо тавсияҳои эҷодӣ ва бозиҳои шавқовар пайдо мекунед, ки бо кӯдаки хурдсоли худ барои рушди малакаҳои базавии математикии ӯ истифода баред.",
    second_section_pc: "Бозӣ ва эҷодкорӣ",
    second_section_pc_desc: "Маводи ин бахш рушди эҷодкорӣ, тахайюл ва малакаҳои ҷисмонӣ, ба монанди тавозун ва малакаҳои хуби моторикиро дастгирӣ мекунанд. Волидон ва мураббиён маслиҳатҳо, бозиҳо ва дастуру тавсияҳо барои бозӣ, рушди малакаҳои муҳими маърифатӣ,. инчунин барои ҳалли мушкилот ва ифодаи эҳсосотро дастгирӣ мекунад, дар инҷо пайдо мекунанд.",
    second_section_sel: "Омӯзиши эҳсосотии иҷтимоӣ",
    second_section_sel_desc: "Маводи ин бахш ба кӯдакон дар рушди муносибатҳои мусбӣ бо калонсолон ва дигар кӯдакон, ҳамчунин чӣ гуна идора ва ифодаи эҳсосот кӯмак мерасонанд. Бо навбат мубодилаи фикр кардан, меҳрубон ва ҳамдард будан малакаҳои муҳимест, ки кӯдакон дар синни хурдӣ меомӯзанд.",
    partners: "Шарикон",
    lpu_footer: "Платформаи рақамии таълимии «Сандуқчаи Зулбиё» бо дастгирии ЮНИСЕФ ва ҳамкорӣ бо Вазорати маориф ва илми Ҷумҳурии Тоҷикистон барои таъмини дастрасии доимӣ ба таҳсилоти томактабӣ таҳия шудааст.",

    /*страница about lp*/
    a_about_lp: "Дар бораи Сандуқчаи Зулбиё",
    a_about_lp_desc: "Ҳамчун як ҳалли наве, ки барои рафъи холигӣ дар соҳаи маориф пешбинӣ шудааст, Сандуқчаи Зулбиё платформаест, ки омӯзиши босифат ва тағйирёбандаро фароҳам меорад. Сандуқчаи Зулбиё натиҷаи ҳамкориҳои ЮНИСЕФ, Майкрософт ва Донишгоҳи Кембриҷ барои ҳалли мушкилотест, ки беш аз 1,5 миллион кӯдакони синни то 6 сола дар Ҷумҳурии Тоҷикистон ба таҳсилоти доимии босифат ва рафъи маҳдудияти дастрасӣ ва фарогирии кам дар саросари кишвар, таҳия шудаст",
    a_our_mission: "Вазифаи мо",
    a_our_mission_desc: "Таъмини дастрасии давомдори кӯдакон ва ҷавонон дар ҷумҳурӣ ва баланд бардоштани натиҷаҳои таълим тавассути таҳсилоти баландсифати сайёр барои дастгирии ҷалби онҳо ба дигар зинаи таҳсилот ва ё имкониятҳо, аз ҷумла таҳсилоти расмӣ.",
    a_million: "860 ҳазор",
    a_million_desc: "кӯдакони хурдсол таҳти хавфи таҷрибаи манфӣ доштан дар синни барвақтӣ ва аз таҳсилоти босифати барвақтӣ маҳрум будан, қарор доранд.",
    a_million_2: "84%",
    a_million_2_desc: "кӯдакони синни аз 3 то 6 сола дар ҷумҳурӣ аз имкониятҳо ва хизматрасониҳои таълими барвақтӣ маҳруманд",
    a_covid_19: "Covid-19",
    a_covid_19_desc: "Вақте ки пандемияи оғоз ёфт ва муассисаҳои таълимӣ дар Ҷумҳурии Тоҷикистон баста шуданд, платформаи Сандуқчаи Зулбиё, ҳамчун яке аз роҳҳои ҳалли таъмини дастрасии доимӣ ба омӯзиш ва таълим барои кӯдакон ва мураббиён пешниҳод карда шуд. Бо платформаи Сандуқчаи Зулбиё ва барномаи таълимӣ, ки имконияти омӯзиши фосилавиро фароҳам меорад, мураббиён ва волидайн метавонанд омӯзиши фосилавиро барои кӯдакони хурдсол бо истифода аз таҷҳизоти зарурӣ дар шароити хона роҳнамоӣ кунанд.",
    a_covid_19_desc_2: "Косово, Тимор-Лесте ва Украинааввалин шуда, барномаи таълимии рушди барвақтиро фосилавӣ тавассути платформаи рақамӣ  амалӣ намоянд. Мундариҷа барои кӯдакони синни томактабӣ дорои китобҳои рақамӣ, видеофилмҳо ва маводи иловагӣ барои волидони кӯдакони дорои эҳтиёҷоти махсус (маъюбон ва ақаллиятҳо) мебошад.",
    a_lp_world: "Платформаҳои рақамӣ дар саросари ҷаҳон",

    /*страница родителей*/
    par_title: "Волидайн",
    par_desc: "Волидон метавонанд оид ба рушди кӯдакони хурдсоли синни 0 то шашсола, тавассути бозиҳо, машғулиятҳо, дастуру тавсияҳо дар мавзӯъҳои гуногун, аз ҷумла усулҳои дастгирии кӯдакони имконияташон маҳдуд маълумоти бештар гиранд.",
    par_how: "Волидон аз Сандуқчаи Зулбиё чӣ гуна манфиат гирифта метавонанд?",
    par_how_desc: "Омӯзиш дар ҳама ҷо рух медиҳад, на танҳо дар мактаб. Волидон ва парасторон метавонанд рушди кӯдакони хурдсолро бо машғулиятҳое, ки маводи гаронарзишро талаб намекунанд, дастгирӣ кунанд. Машғулиятҳое, ба мисли муошират, суруд хондан, китобхонӣ ва савол додан саводнокӣ ва малакаҳои муҳими забономӯзии  барвақтро инкишоф медиҳанд. Дар ҳаёти ҳаррӯза мушоҳида кардани нақшҳо, шаклҳо ва рақамҳо барои омӯзиши баъдии математика замина фароҳам меорад. Бозӣ бо кӯдакони хурдсол дар ҳалли мушкилот, изҳори эҳсосот ва эҷоди робитаҳо бо калонсолони ғамхор кӯмак мекунад. Инкишоф додани ин малакаҳо дар муҳити хона тавассути захираҳои Сандуқчаи Зулбиё дучанд осон аст.",
    par_activites_and_games: "Машғулиятҳо ва бозиҳо",
    par_activites_and_games_desc: "Мавод барои волидон ва мураббиёни муассисаҳои таҳсилоти томактабӣ, ки дар ҷустуҷӯи бозиҳо ва машғулиятҳо бо кӯдакони хурдсоли синни аз 0 то шашсола мебошанд.",
    par_tips_guide: "Дастуру тавсияҳо",
    par_tips_guide_desc: "Дастуру тавсияҳои муфид барои волидон ва мураббиёни муассисаҳои таҳсилоти томактабӣ оид ба рушди иҷтимоиву эҳсосии кӯдакон, тарзи хондани ба кӯдакон ва роҳу усули дастгирии кӯдакони маъюб дар муҳити хона ва синф.",
    par_go_actv: "Ба машғулиятҳо ва бозиҳо гузаред",
    par_go_tips: "Ба машғулиятҳо ва бозиҳо гузаред",
    par_first_tab_line: '<i class="fas fa-home"></i> Бозӣ дар хона',
    par_second_tab_line: '<i class="fas fa-route"></i> Машғулиятҳо дар берун',
    par_third_tab_line: '<i class="fas fa-child"></i> Сатҳи ҳамкорӣ',

    /*FAQ*/
    f_main_title: "Саволҳои зиёд такроршуда",
    f_first_question: '<i class="fas fa-plus faq-plus"></i><i class="fas fa-minus faq-minus"></i>&nbsp;&nbsp;&nbsp; Кӣ барномаи таълимии кишварҳои мизбони Сандуқчаи Зулбиёро муайян мекунад?',
    f_first_answer: "Гурӯҳи мутахассисони ЮНИСЕФ дар дохили кишвар, ки дар якҷоягӣ бо Вазорати маориф ва илм ва шарикон кор карда истодааст, то ба платформаи рақамии Сандуқчаи Зулбиё дохил карда шудани барномаи мувофиқи таълимии миллиро таъмин намояд. Платформаи рақамии Сандуқчаи Зулбиё дорои барномаи миллии таълимӣ мебошад: сохтори барномаи таълимӣ хусусияти миллӣ дорад ва ба таъкид кардани барномаи таълимӣ ва мундариҷаи маҳаллӣ ба таври умумидавлатӣ ва муназзам равона шудааст, аммо ин аз барномаи таълими универсалӣ фарқи калон дорад. Барномаи платформаи рақамии Сандуқчаи Зулбиё китобхонаи маъхазҳои иловагии ҷаҳонии таълимро ҷамъ меорад, ки метавонанд барои беҳтар кардани натиҷаҳои таълим барои корбарон барномаҳои таълимии маҳаллиро ҳамроҳ кунанд ва афзун кунанд. Ин як платформа барои расонидани мундариҷаи маҳаллӣ ва ба муҳит мувофиқгардонидашуда, бо захираҳои иловагии ҷаҳонӣ мебошад.",
    f_second_question: '<i class="fas fa-plus faq-plus"></i><i class="fas fa-minus faq-minus"></i>&nbsp;&nbsp;&nbsp;Оё барномаҳои таълимӣ бо забонҳои миллӣ пешниҳод карда мешаванд?',
    f_second_answer: "Ҳадаф дастрас кардани шиносномаи донишҷӯён барои ҳама кӯдакони осебпазир мебошад. Омӯзиши шиноснома мундариҷаи дар сатҳи маҳаллӣ таҳияшударо ҳамчун модели омӯзишии худ, бо мундариҷаи ҷаҳонии иловагӣ, ки бо забонҳои гуногун мавҷуданд, истифода мебарад. Шиносномаи таҳсил метавонад бо забонҳои гуногуни миллӣ ҷойгир карда шавад ва забони миллии таълимро дар кишвар дастгирӣ кунад.",
    f_third_question: '<i class="fas fa-plus faq-plus"></i><i class="fas fa-minus faq-minus"></i>&nbsp;&nbsp;&nbsp;Бо кадом роҳҳо шумо метавонед платформаи рақамии Сандуқчаи Зулбиёро барои хонандагон ва мураббиён истифода баред?',
    f_third_answer_1: "Пешниҳоди роҳҳои содда ва осон барои омӯзиш ва ноил шудан ба ҳадафҳо",
    f_third_answer_2: "Интерфейсҳои ҷолиб, ки омӯзишро шавқовар мекунанд",
    f_third_answer_3: "Рушди малака тавассути барномаҳои таълими инфиродӣ",
    f_third_answer_4: "Пешрафтро пайгирӣ кунед ва натиҷаҳоро бо таҳлили визуалӣ дар як ҷо чен кунед",
    f_third_answer_5: "Бо истифода аз дастгоҳи рақамӣ ва забони интихобгардидаи хонанда, таҷрибаи омӯзиши инфиродӣ эҷод кунед.",

    /*EDUCATORS*/
    e_main_title: "Мураббиён",
    e_edu_desc: "Новобаста аз он ки шумо бо кӯдакон дар боғча ё муассисаи таълимии томактабӣ кор мекунед, маводи ин бахш барои шумо ҳаст. Шумо мундариҷаи баландсифатро барои кӯдакони хурдсол хоҳед ёфт, ки онҳо метавонанд аз як қатор машғулиятҳо ва самтҳо, аз рушди саводнокӣ ва забономӯзӣ то бозиҳо ва эҷодкорӣ фаро гирад. Шумо инчунин курсҳои омӯзишӣ ва мақолаҳоро пайдо хоҳед кард, ки ба рушди касбии худи шумо кӯмак мекунанд.",
    e_how_title: "Омӯзгорон Сандуқчаи Зулбиё-ро чӣ гуна истифода мебаранд?",
    e_how_desc: "Кӯдакони синни томактабӣ ҳар рӯз аз идоракунии эҳсосоти худ то омӯхтани ҳарфҳо, садоҳо ва рақамҳо меомӯзанд. Агар шумо мураббии таҳсилоти томактабӣ бошед, дар ин ҷо шумо маводи баландсифатро пайдо мекунед, ки ба шумо дар кор бо кӯдакони синни томактабӣ кӯмак мерасонанд. Нақшаи дарсҳо, машғулиятҳо ва бозиҳо, дастуру тавсияҳо ва курсҳои таълими давомдор аз рӯи синну сол ҷудо карда шуда, соҳаи таҳсил, аз омӯзиши иҷтимоӣ-эмотсионалӣ, бозӣ ва эҷодкорӣ, математикаи барвақтӣ ва ҳалли масъалаҳо, забономӯзӣ, рушди саводнокӣ ва муошират иборат мебошанд.",
    e_courses_title: "Курсҳои таълимӣ барои мураббиён",
    e_courses_desc: "Дар ин бахш, шумо курсҳои таълими давомдорро хоҳед ёфт, ки як қатор мавзӯъҳоро дар бар мегиранд, аз ҷумла:",
    e_courses_desc_1: "фароҳам овардани муҳити фарогир барои кӯдакони маъюб ва ақаллиятҳо,",
    e_courses_desc_2: "фаҳмиши зинаҳои рушди кӯдакон ва таъмин намудин шароити мусоид барои рушди ҳаматарафаи кӯдакони хурдсол,",
    e_courses_desc_3: "дастгирии инкишофи иҷтимоию равонии кӯдакон ва омода намудани онҳо ба мушкилоти зиндагӣ",
    e_courses_btn: `Ба курсхоии таълимӣ барои мураббиён гузаред  <i class="fas fa-arrow-right"></i>`,
    e_lessons_title: "Нақшаи дарсҳо",
    e_lessons_desc: "Новобаста аз он ки шумо дар ҷустуҷӯи дастури рушди малакаҳои моторикӣ барои хурдтаракон ё машғулияти ҳисобкунии барои кӯдакони 4-сола ҳастед, дар ин боб дарсҳои лозимии шумо мавҷуданд. Шумо инчунин видеоҳо, сабтҳои аудиоӣ, бозиҳо ва машқҳоро, ки аз рӯи синну сол ва мавзӯъҳо гурӯҳбандӣ шудаанд, дастрас мекунед.",
    e_lessons_btn: `Ба накшаи дарсҳо гузаред <i class="fas fa-arrow-right"></i>`,
    e_act_title: "Машғулият ва бозиҳо",
    e_act_desc: "Агар шумо дар ҷустуҷӯи бозии таълимӣ ва шавқовар барои кӯдакони 3-сола бошед, дигар ташвиш накашед! Дар ин ҷо шумо бозиҳои зиёдеро барои самтҳои гуногун, аз ҷумла математикаи барвақтӣ, рушди иҷтимоӣ-эҳсосотӣ пайдо мекунед. Шумо инчунин бозиҳо ва машғулиятҳо барои кӯдакони хурдсол аз синни таваллуд то 2-сола пайдо мекунед",
    e_act_btn: `Ба машгулиятхо ва бозихо гузаред <i class="fas fa-arrow-right"></i>`,
    e_tips_title: "Дастуру тавсияҳо",
    e_tips_desc: "Дар ин бахш шумо дастуру тавсияҳои муфидро оид ба рушди иҷтимоӣ ва эҳсосии кӯдакон, тарзи хониш ба кӯдакон ва дастгирии кӯдакони маъюб дар муҳити хона ва синф пайдо мекунед.",
    e_tips_btn: `Ба дастуру тавсияҳо гузаред <i class="fas fa-arrow-right"></i>`,
    e_first_tab_line: "Шаҳодатномаҳо",
    e_second_tab_line: "Маводи иловагӣ",
  }
};

setLanguage(getCookie('lang') || 'tj');

function setLanguage(language) {
  var x = getCookie('lang');
  if (x) {
    if (x != language) {
      eraseCookie('lang');
      setCookie('lang', language, 7);
    }
  } else {
    setCookie('lang', language, 7);
  }
  document.documentElement.lang = language;
  var currentLanguage = getCookie('lang');

  app.lang = app.translations[currentLanguage] || app.translations.en;
  changeLogo(currentLanguage);
  for (const property in app.lang) {
    // console.log(`${property}: ${app.lang[property]}`);
    if (document.getElementById(property) != null && currentLanguage != "en") {
      document.getElementById(property).innerHTML = app.lang[property];
      document.getElementById(property).style.fontFamily = 'OpenSans';
    }
  }
  
  // custom feedback form settings
  var feedback_frm =  document.getElementById('feedback_frm1');
  if(typeof(feedback_frm) != 'undefined' && feedback_frm != null){
    if(currentLanguage=='tj') {
      document.getElementById("feedback_frm1").href="https://forms.gle/ymhPMj8hSD5ADW1X9";
      document.getElementById("feedback_frm1").title="Мушкилоти техникӣ";
    }
    if(currentLanguage=='ru') {
      document.getElementById("feedback_frm1").href="https://forms.gle/Ln88WpAXMsSJ5X9Q7";
      document.getElementById("feedback_frm1").title="Форма обратной связи";
    }
    if(currentLanguage=='en') {
      document.getElementById("feedback_frm1").href="https://forms.gle/wrL92AP7MvVYWkuG8";
      document.getElementById("feedback_frm1").title="Feedback form";
    }  
  }

}

function setCookie(name, value, days) {
  var expires = "";
  if (days) {
    var date = new Date();
    date.setTime(date.getTime() + (days * 24 * 60 * 60 * 1000));
    expires = "; expires=" + date.toUTCString();
  }
  document.cookie = name + "=" + (value || "") + expires + "; path=/";
}
function getCookie(name) {
  var nameEQ = name + "=";
  var ca = document.cookie.split(';');
  for (var i = 0; i < ca.length; i++) {
    var c = ca[i];
    while (c.charAt(0) == ' ') c = c.substring(1, c.length);
    if (c.indexOf(nameEQ) == 0) return c.substring(nameEQ.length, c.length);
  }
  return null;
}
function eraseCookie(name) {
  document.cookie = name + '=; Path=/; Expires=Thu, 01 Jan 1970 00:00:01 GMT;';
}

function changeLogo(lang) {
  var img = document.getElementById("logo_img");
  if(lang == 'en'){
    img.src = "img/logo_en.png";
  }else if(lang=='ru'){
    img.src = "img/logo_ru.png";
  }else if(lang=='tj'){
    img.src = "img/logo_tj.png";
  }
/*var src = document.getElementById("logo_a");
src.appendChild(img);*/
}

